app/Controllers/Allemployee.php

    public function index()
    {
        $model = new UserModel();
        $data['users'] = $model->findAll(); // Fetch all users
---
SELECT *
FROM `info_users`