app/Controllers/BarcodeController.php

SELECT `b`.*, `c`.`id` AS `customer_id`, `c`.`customer_name`
FROM `pine_store_warehouse_barcodes` `b`
LEFT JOIN `customer_inventory` `i` ON `i`.`id` = `b`.`rack_product_id`
LEFT JOIN `pine_upload_inventory` `c` ON `c`.`id` = `i`.`upload_inventory_id`
ORDER BY `b`.`generated_at` DESC
---
    public function list()
    {
        $db = \Config\Database::connect();

        $builder = $db->table('pine_store_warehouse_barcodes b');
        $builder->select('b.*, i.item_name, c.id AS customer_id, c.customer_name');
        $builder->join('customer_inventory i', 'i.id = b.rack_product_id', 'left');
        $builder->join('pine_upload_inventory c', 'c.id = i.upload_inventory_id', 'left');
        $builder->orderBy('b.generated_at', 'DESC');

        // Apply search filters if present
        $customerName = $this->request->getGet('customer_name');
        $customerId = $this->request->getGet('customer_id');

        if (!empty($customerName)) {
            $builder->like('c.customer_name', $customerName);
        }

        if (!empty($customerId)) {
            $builder->where('c.id', $customerId);
        }

        $query = $builder->get();