app/Controllers/ChildBarcodeController.php

SELECT `id`, `item_name`
FROM `customer_inventory`
---
    public function viewPage()
    {
        $db = \Config\Database::connect();
        $inventory = $db->table('customer_inventory')
            ->select('id, item_name')
            ->get()
            ->getResultArray();

SELECT *
FROM `customer_inventory`
WHERE `id` = '151'
---
    public function getCustomerAndBarcodes($inventory_id)
    {
        $db = \Config\Database::connect();

        // Get inventory item
        $inventory = $db->table('customer_inventory')
            ->where('id', $inventory_id)
            ->get()
            ->getRow();