app/Controllers/Home.php

    public function index()
    {
        $warehouseModel = new WarehouseModel();
        $cards = $warehouseModel->findAll();

        // Add this block to count total leads
        $db = \Config\Database::connect();
        $builder = $db->table('pine_upload_inventory'); // use your actual leads table
        $totalLeads = $builder->countAll();
---
SELECT *
FROM `warehouse`
SELECT COUNT(*) AS `numrows` FROM `pine_upload_inventory`

    public function register()
    {
        $warehouseModel = new warehouseModel();

        $data['warehouses'] = $warehouseModel->findAll();
---
SELECT *
FROM `warehouse`