app/Controllers/Home.php

    public function viewInventory($leadId)
    {
        $db = \Config\Database::connect();
        $builder = $db->table('customer_inventory');
        $builder->where('upload_inventory_id', $leadId);
        $query = $builder->get();
---
SELECT *
FROM `customer_inventory`
WHERE `upload_inventory_id` = '151'