app/Controllers/Home.php

SELECT *
FROM `warehouse`
---
    public function getWarehouses()
    {
        $warehouseModel = new WarehouseModel();
        return $this->response->setJSON($warehouseModel->findAll());