app/Controllers/Login.php

SELECT *
FROM `info_users`
WHERE LOWER(email) = 'priya@gmail.com'
 LIMIT 1
---
    public function login()
    {
        $session = session();
        $request = \Config\Services::request();

        $email = trim($request->getPost('email'));
        $password = trim($request->getPost('password'));

        $model = new \App\Models\UserModel();
        $user = $model->where('LOWER(email)', strtolower($email))->first();

SELECT *
FROM `customer_inventory`
WHERE `upload_inventory_id` = '278'
---
    public function customerInventory()
    {
        $customerId = session()->get('customer_id'); // This is pine_upload_inventory.id

        if (!$customerId) {
            return redirect()->to('/cus_login')->with('error', 'Please login first.');
        }

        // Load model
        $inventoryModel = new \App\Models\CustomerInventoryModel();

        // Find customer inventory where upload_inventory_id matches customer ID
        $data['inventories'] = $inventoryModel
            ->where('upload_inventory_id', $customerId)
            ->findAll();