app/Controllers/WarehouseController.php

SELECT *
FROM `warehouse`
---
    public function index()
    {
        $model = new WarehouseModel();
        $data['warehouses'] = $model->findAll();